m-okada/QV08/emu/ARM/kinetis_workspace/t03/SDK/platform/drivers/inc/fsl_edma_driver.h
/*
 * Copyright (c) 2013 - 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#if !defined(__FSL_EDMA_DRIVER_H__)
#define __FSL_EDMA_DRIVER_H__

#include <stdint.h>
#include "fsl_device_registers.h"
#include "fsl_edma_request.h"
#include "fsl_edma_hal.h"
#include "fsl_dmamux_hal.h"
#include "fsl_os_abstraction.h"
#if FSL_FEATURE_SOC_EDMA_COUNT

/*!
 * @addtogroup edma_driver
 * @{
 */

/*! @brief Array for the eDMA module register base address. */
extern DMA_Type * const g_edmaBase[];

/*! @brief Array for DMAMUX module register base address. */
extern DMAMUX_Type * const g_dmamuxBase[];

/*! @brief Two dimensional array for eDMA channel interrupt vector number. */
extern const IRQn_Type g_edmaIrqId[DMA_INSTANCE_COUNT][FSL_FEATURE_EDMA_MODULE_CHANNEL];

#if defined FSL_FEATURE_EDMA_HAS_ERROR_IRQ
/*! @brief Array for eDMA module's error interrupt vector number. */
extern const IRQn_Type g_edmaErrIrqId[DMA_INSTANCE_COUNT];
#endif

/*******************************************************************************
 * Definitions
 ******************************************************************************/
/*!
 * @brief Macro for the memory size needed for the software TCD.
 *
 * Software TCD is aligned to 32 bytes. To make sure the software TCD can meet the
 * eDMA module requirement, allocate memory with extra 32 bytes.
 */
#define STCD_SIZE(number)           ((number + 1) * 32)
#define STCD_ADDR(address)          (edma_software_tcd_t *)(((uint32_t)address + 32) & ~0x1FU)

/*!
 * @brief The user configuration structure for the eDMA driver.
 *
 * Use an instance of this structure with the EDMA_DRV_Init() function. This allows the user to configure
 * settings of the EDMA peripheral with a single function call.
 * @internal gui name="Configuration" id="edmaCfg"
 */
typedef struct EDMAUserConfig {
    edma_channel_arbitration_t chnArbitration;  /*!< eDMA channel arbitration. @internal gui name="Channel arbitration" id="ChnArbitration" */
#if FSL_FEATURE_EDMA_CHANNEL_GROUP_COUNT > 0x1U
    edma_group_arbitration_t groupArbitration;  /*!< eDMA group arbitration. @internal gui name="Group arbitration" id="GroupArbitration" */
    edma_group_priority_t groupPriority;        /*!< eDMA group priority. It is used while eDMA
                                                     group arbitration is set to fixed priority. @internal gui name="Group priority" id="GroupPriority" */
#endif
    bool notHaltOnError;
    /*!<  Any error causes the HALT bit to set. Subsequently, all service requests are ignored until the HALT bit is cleared.
    @internal gui name="Set HALT on Error" id="HaltOnError" */
} edma_user_config_t;

/*!
 * @brief Channel status for eDMA channel.
 *
 * A structure describing the eDMA channel status. The user can get the status by callback parameter
 * or by calling EDMA_DRV_getStatus() function.
 */
typedef enum _edma_chn_status {
    kEDMAChnNormal = 0U,           /*!< eDMA channel is occupied. */
    kEDMAChnIdle,                  /*!< eDMA channel is idle. */
    kEDMAChnError                  /*!< An error occurs in the eDMA channel. */
} edma_chn_status_t;


/*!
 * @brief Definition for the eDMA channel callback function.
 *
 * Prototype for the callback function registered in the eDMA driver.
 */
typedef void (*edma_callback_t)(void *parameter, edma_chn_status_t status);

/*! @brief Macro to get the eDMA physical module indicator from the virtual channel indicator. */
#define VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(chn)     g_edmaBase[chn/FSL_FEATURE_EDMA_MODULE_CHANNEL]

/*! @brief Macro to get the eDMA physical channel indicator from the virtual channel indicator. */
#define VIRTUAL_CHN_TO_EDMA_CHN(chn)                (chn%FSL_FEATURE_EDMA_MODULE_CHANNEL)

/*! @brief Macro to get the DMAMUX physical module indicator from the virtual channel indicator. */
#define VIRTUAL_CHN_TO_DMAMUX_MODULE_REGBASE(chn)   g_dmamuxBase[chn/FSL_FEATURE_DMAMUX_MODULE_CHANNEL]

/*! @brief Macro to get the DMAMUX physical channel indicator from the virtual channel indicator. */
#define VIRTUAL_CHN_TO_DMAMUX_CHN(chn)          (chn%FSL_FEATURE_DMAMUX_MODULE_CHANNEL)

/*! @brief Data structure for the eDMA channel. */
typedef struct EDMAChnState {
    uint8_t channel;                /*!< Virtual channel indicator. */
    edma_callback_t callback;       /*!< Callback function pointer for the eDMA channel. It will
                                         be called at the eDMA channel complete and eDMA channel
                                         error. */
    void *parameter;                /*!< Parameter for the callback function pointer. */
    volatile edma_chn_status_t status;   /*!< eDMA channel status. */
} edma_chn_state_t;

/*! @brief enum type for channel allocation.  */
typedef enum _edma_chn_state_type {
    kEDMAInvalidChannel = 0xFFU, /*!< Macros indicate the failure of the channel request. */
    kEDMAAnyChannel = 0xFEU      /*!< Macros used when requesting channel dynamically. */
} edma_chn_state_type_t;

/*! @brief A type for the DMA transfer. */
typedef enum _edma_transfer_type {
    kEDMAPeripheralToMemory,        /*!< Transfer from peripheral to memory */
    kEDMAMemoryToPeripheral,        /*!< Transfer from memory to peripheral */
    kEDMAMemoryToMemory,            /*!< Transfer from memory to memory */
} edma_transfer_type_t;

/*! @brief Data structure for configuring a discrete memory transfer. */
typedef struct EDMAScatterGatherList {
    uint32_t address;           /*!< Address of buffer. */
    uint32_t length;            /*!< Length of buffer. */
} edma_scatter_gather_list_t;

/*!
 * @brief Runtime state structure for the eDMA driver.
 *
 * This structure holds data that is used by the eDMA peripheral driver to manage
 * multi eDMA channels.
 * The user passes the memory for this run-time state structure and the eDMA
 * driver populates the members.
 */
typedef struct EDMAState {
#if (USE_RTOS)
    mutex_t lock;       /*!< Lock for channel allocation and release. */
#endif
    edma_chn_state_t * volatile chn[FSL_FEATURE_EDMA_DMAMUX_CHANNELS];     /*!< Pointer array storing
                                                                             channel state.  */
} edma_state_t;

