m-okada/QV08/emu/ARM/kinetis_workspace/t03/SDK/platform/drivers/inc/fsl_edma_driver.h
static inline edma_status_t EDMA_DRV_PrepareDescriptorTransfer(
                                edma_chn_state_t *chn, edma_software_tcd_t *stcd,
                                edma_transfer_config_t *config,
                                bool enableInt, bool disableDmaRequest)

{
    EDMA_HAL_STCDSetBasicTransfer(
            VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(chn->channel), stcd, config, enableInt, disableDmaRequest);

    return kStatus_EDMA_Success;

}

/*!
 * @brief Configures the memory address for the next transfer TCD for the software TCD.
 *
 *
 * This function enables the scatter/gather feature for the software TCD and configures the next
 * TCD address.This address points to the beginning of a 0-modulo-32 byte region containing
 * the next transfer TCD to be loaded into this channel. The channel reload is performed as the
 * major iteration count completes. The scatter/gather address must be 0-modulo-32-byte. Otherwise,
 * a configuration error is reported.
 *
 * @param stcd The pointer to the software TCD, which needs to link to the software TCD. The
 * address needs to be aligned to 32 bytes.
 * @param nextStcd The pointer to the software TCD, which is to be linked to the software TCD. The
 * address needs to be aligned to 32 bytes.
 * @return An eDMA error codes or kStatus_EDMA_Success.
 */
static inline edma_status_t EDMA_DRV_PrepareDescriptorScatterGather(
                                edma_software_tcd_t *stcd,
                                edma_software_tcd_t *nextStcd)
{
    EDMA_HAL_STCDSetScatterGatherLink(stcd, nextStcd);
    return kStatus_EDMA_Success;
}

/*!
 * @brief Configures the major channel link the software TCD.
 *
 * If the major link is enabled, after the major loop counter is exhausted, the eDMA engine initiates a
 * channel service request at the channel defined by these six bits by setting that channel start
 * bits.
 *
 * @param stcd The pointer to the software TCD. The address need to be aligned to 32 bytes.
 * @param linkChn Channel number for major link
 * @return An eDMA error codes or kStatus_EDMA_Success.
 */
static inline edma_status_t EDMA_DRV_PrepareDescriptorChannelLink(
                                edma_software_tcd_t *stcd, uint32_t linkChn)
{
    EDMA_HAL_STCDSetChannelMajorLink(stcd, linkChn, true);
    return kStatus_EDMA_Success;
}

/*!
 * @brief Copies the software TCD configuration to the hardware TCD.
 *
 * @param chn The pointer to the channel state structure.
 * @param stcd memory pointing to the software TCD.
 * @return An eDMA error codes or kStatus_EDMA_Success.
 */
edma_status_t EDMA_DRV_PushDescriptorToReg(edma_chn_state_t *chn, edma_software_tcd_t *stcd);

/*!
 * @brief Configures the DMA transfer in a scatter-gather mode.
 *
 * This function configures the descriptors in a loop chain. The user passes a block of memory into this
 * function and the memory is divided into the "period" sub blocks. The DMA driver  configures the "period"
 * descriptors. Each descriptor stands for a sub block. The DMA driver  transfers data from the first
 * descriptor to the last descriptor. Then, the DMA driver  wraps to the first descriptor to continue
 * the loop. The interrupt handler is called every time a descriptor is completed.
 * The user can get a transfer status of a descriptor by calling the edma_get_descriptor_status() function in the interrupt handler or any
 * other task context. At the same
 * time, calling the edma_update_descriptor() function notifies the DMA driver that the content belonging to
 * a descriptor is already updated and the DMA needs to count it as and underflow next time it
 * loops to this descriptor.
 * This is an example that describes how to use this interface in audio playback case:
 * 1. Use a ping-pong buffer to transfer the data, the size of the each buffer is 1024 bytes.
 * 2. Each DMA request needs to transfer 8 bytes.
 * 3. The audio data is 16 bit.
   @code
   edma_chn_state_t chn; <--- Simply allocates the structure.
   edma_software_tcd_t stcd[2]; <-- Need 32 bytes aligned, two buffer block, needs 2 TCD.
   uint32_t srcAddr = buffer; <----Start address of the buffer.
   uint32_t destAddr = SAI_TDR; <-----Destination address, usually SAI TDR register.

   EDMA_DRV_ConfigLoopTransfer(&chn, stcd, kEDMAMemoryToPeripheral, srcAddr, destAddr,
   kEDMATransferSize_2Bytes, 8, 2048, 2) ;

   @endcode
 * @param chn The pointer to the channel state structure.
 * @param stcd Memory pointing to software TCDs. The user must prepare this memory block. The required
 * memory size is equal to a "period" * size of(edma_software_tcd_t). At the same time, the "stcd"
 * must align with 32 bytes. If not, an error occurs in the eDMA driver.
 * @param type Transfer type.
 * @param srcAddr A source register address or a source memory address.
 * @param destAddr A destination register address or a destination memory address.
 * @param size Bytes to be transferred on every DMA write/read. Source/Dest share the same write/read
 * size.
 * @param bytesOnEachRequest Bytes to be transferred in each DMA request.
 * @param totalLength Total bytes to be transferred in a loop cycle. In audio case, it means the total buffer size.
 * @param number The number of the TCDs, usually in audio case, it means the buffer block number.
 *
 * @return An error code of kStatus_EDMA_Success
 */
edma_status_t EDMA_DRV_ConfigLoopTransfer(
                            edma_chn_state_t *chn, edma_software_tcd_t *stcd,
                            edma_transfer_type_t type,
                            uint32_t srcAddr, uint32_t destAddr, uint32_t size,
                            uint32_t bytesOnEachRequest, uint32_t totalLength, uint8_t number);

/*!
 * @brief Configures the DMA transfer in a scatter-gather mode.
 *
 * This function configures the descriptors into a single-ended chain. The user passes blocks of memory into
 * this function. The interrupt is triggered only when the last memory block is completed. The memory block
 * information is passed with the edma_scatter_gather_list_t data structure, which can tell
 * the memory address and length.
 * The DMA driver configures the descriptor for each memory block, transfers the descriptor from the
 * first one to the last one, and stops.
 *
 * @param chn The pointer to the channel state structure.
 * @param stcd Memory pointing to software TCDs. The user must prepare this memory block. The required
 * memory size is equal to the "number" * size of(edma_software_tcd_t). At the same time, the "stcd"
 * must align with 32 bytes. If not, an error occurs in the eDMA driver.
 * @param type Transfer type.
 * @param size Bytes to be transferred on each DMA write/read. Source/Dest share the same write/read
 * size.
 * @param bytesOnEachRequest Bytes to be transferred in each DMA request.
 * @param srcList Data structure storing the address and length to be transferred for source
 * memory blocks. If the source memory is peripheral, the length is not used.
 * @param destList Data structure storing the address and length to be transferred for destination
 * memory blocks. If in the memory-to-memory transfer mode, the user must ensure that the length of
 * the destination scatter gather list is equal to the source scatter gather list. If the destination memory is a
 * peripheral register, the length is not used.
 * @param number The number of TCD memory blocks contained in the scatter gather list.
 *
 * @return An error code of kStatus_EDMA_Success
 */
edma_status_t EDMA_DRV_ConfigScatterGatherTransfer(
                        edma_chn_state_t *chn, edma_software_tcd_t *stcd,
                        edma_transfer_type_t type,
                        uint32_t size, uint32_t bytesOnEachRequest,
                        edma_scatter_gather_list_t *srcList, edma_scatter_gather_list_t *destList,
                        uint8_t number);

/* @} */

/*!
  * @name eDMA Peripheral driver channel operation functions
  * @{
  */
/*!
 * @brief Starts an eDMA channel.
 *
 * This function enables the eDMA channel DMA request.
 *
 * @param chn The pointer to the channel state structure.
 *
 * @return An eDMA error codes or kStatus_EDMA_Success.
 */
edma_status_t EDMA_DRV_StartChannel(edma_chn_state_t *chn);

/*!
 * @brief Stops the eDMA channel.
 *
 * This function disables the eDMA channel DMA request.
 *
 * @param chn The pointer to the channel state structure.
 *
 * @return An eDMA error codes or kStatus_EDMA_Success.
 */
edma_status_t EDMA_DRV_StopChannel(edma_chn_state_t *chn);

/* @} */

/*!
  * @name eDMA Peripheral callback and interrupt functions
  * @{
  */

/*!
 * @brief Registers the callback function and the parameter for eDMA channel.
 *
 * This function registers the callback function and the parameter into the eDMA channel state structure.
 * The callback function is called when the channel is complete or a channel error occurs. The eDMA
 * driver passes the channel status to this callback function to indicate whether it is caused by the
 * channel complete event or the channel error event.
 *
 * To un-register the callback function, set the callback function to "NULL" and call this
 * function.
 *
 * @param chn The pointer to the channel state structure.
 * @param callback The pointer to the callback function.
 * @param parameter The pointer to the callback function's parameter.
 *
 * @return An eDMA error codes or kStatus_EDMA_Success.
 */
edma_status_t EDMA_DRV_InstallCallback(
        edma_chn_state_t *chn, edma_callback_t callback, void *parameter);

/*!
 * @brief IRQ Handler for eDMA channel interrupt.
 *
 * This function is provided as the default flow for eDMA channel interrupt. This function clears the
 * status and calls the callback functions.
 * The user can add this function into the hardware interrupt entry and implement a
 * custom interrupt action function.
 *
 * @param channel Virtual channel number.
 */
void EDMA_DRV_IRQHandler(uint8_t channel);

/*!
 * @brief ERROR IRQ Handler for eDMA channel interrupt.
 *
 * This function is provided as the default action for eDMA module error interrupt. This function
 * clears status, stops the error on a eDMA channel, and calls the eDMA channel callback function if the
 * error eDMA channel is already requested.
 * The user can add this function into the eDMA error interrupt entry and implement a custom
 * interrupt action function.
 *
 * @param instance eDMA module indicator.
 */
void EDMA_DRV_ErrorIRQHandler(uint8_t instance);

/* @} */

/*!
  * @name eDMA Peripheral driver miscellaneous functions
  * @{
  */
/*!
 * @brief Gets the eDMA channel status.
 *
 * @param chn The pointer to the channel state structure.
 *
 * @return Channel status.
 */
static inline edma_chn_status_t EDMA_DRV_GetChannelStatus(edma_chn_state_t *chn)
{
    return chn->status;
}

/*!
 * @brief Gets the unfinished bytes for the eDMA channel current TCD.
 *
 * This function checks the TCD (Task Control Descriptor) status for a specified eDMA channel and returns
 * the bytes that have not finished.
 * This function can only be used for one TCD scenario.
 *
 * @param chn The pointer to the channel state structure.
 *
 * @return Bytes already transferred for the current TCD.
 */
static inline uint32_t EDMA_DRV_GetUnfinishedBytes(edma_chn_state_t *chn)
{
    uint32_t channel = chn->channel;

    return EDMA_HAL_HTCDGetUnfinishedBytes(
                    VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(channel),
                    VIRTUAL_CHN_TO_EDMA_CHN(channel));
}

/*!
 * @brief Gets the bytes already transferred for the eDMA channel current TCD.
 *
 * This function checks the TCD (Task Control Descriptor) status for a specified eDMA channel and returns
 * the bytes that remain to the user.
 * This function can only be used for one TCD scenario.
 *
 * @param chn The pointer to the channel state structure.
 *
 * @return Bytes already transferred for the current TCD.
 */
static inline uint32_t EDMA_DRV_GetFinishedBytes(edma_chn_state_t *chn)
{
    uint32_t channel = chn->channel;

    return EDMA_HAL_HTCDGetFinishedBytes(
                    VIRTUAL_CHN_TO_EDMA_MODULE_REGBASE(channel),
                    VIRTUAL_CHN_TO_EDMA_CHN(channel));
}

/* @} */


/* @} */

#if defined(__cplusplus)
}
#endif

/*! @} */

#endif
#endif /* __FSL_EDMA_DRIVER_H__ */
/*******************************************************************************
 * EOF
 ******************************************************************************/

